# AsCurveFollowingFace Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Edge..::..AsCurveFollowingFace Method
Edge Class See Also
---
Returns a curve that corresponds to this edge as oriented in its topological direction on the specified face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Curve AsCurveFollowingFace(
	Face faceForDir
)
```

Visual Basic
---
```text
Public Function AsCurveFollowingFace ( _
	faceForDir As Face _
) As Curve
```

Visual C++
---
```text
public:
Curve^ AsCurveFollowingFace(
	Face^ faceForDir
)
```

# ### Parameters
faceForDir
    Type: Autodesk.Revit.DB..::..FaceSpecifies the face, on which the curve will follow the topological direction of the edge.
# ### Return Value
It can be an Arc, Line, or HermiteSpline.
# Remarks
Evaluating the edge using EvaluateOnFace gives the same result as evaluating the curve returned by AsCurveFollowingFace with a normalized curve parameter. When a Hermite spline is returned, the two evaluated points will be approximately equal.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the specified faceForDir is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the specified faceForDir is not one of the faces for this edge. |

# See Also
Edge Class
Autodesk.Revit.DB Namespace